In [1]:
import pandas as pd

In [3]:
train = pd.read_csv('train.csv')

### 데이터 전처리
- 데이터가 정제되어 있지 않기 떄문에 전처리를 통해 불필요한 데이터 직접 처리해야함
- 데이터 전처리하는 경우 : 결측치와 이상치를 처리

#### 결측치란?
- 데이터에 값이 없는것 = 데이터가 존재하지 않음
- 데이터 전처리과정에서 미리 처리를 해줘야함
- 보통 N/A, NULL, NaN의 표기로 쓰이는데 => 파이썬에선 NaN으로 표시됨

In [6]:
train.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [8]:
# 2. 결측치 확인
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
# 3. 상위 5개항목 출력
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### shape
- 몇행, 몇열로 데이터필드가 구성되어 있는지 확인
- 데이터프레임의 크기 파악하기위해 사용
- 뒤에 괄호없이 ~~.shape 로 사용

#### info()
- 데이터필드 구성하고 있는 변수들의 속성(type)파악

#### describe()
- 데이터의 평균, 표준편차, 분산, 4분위데이터등 한 눈에 필요한 데이터를 한번에 호출해주는 함수

In [13]:
# 4. 데이터셋의 각 필드 데이터 분포 확인
# describe() : 요약 통계량 출력
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
# 5.각 컬럼의 데이터 타입 확인하기
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

#### unique()
: 데이터에 고유값들이 어떠한 종류들이 있는지 알고싶을때 사용하는함수

#### nunique()
: 데이터에 고유값들의 수를 출력해주는 함수
: 데이터의 고유값 총 수를 알고 싶을때 사용

#### value_counts()
: 값별로 데이터의 수를 출력해주는 함수

In [25]:
# 6.'Cabin', 'Embarked'필드에는 어떤 값이 있는지 확인하기
train["Cabin"].unique()
# train.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [26]:
# 6.'Cabin', 'Embarked'필드에는 어떤 값이 있는지 확인하기
train["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [30]:
# 7. 생존한사람, 사망한 사람 수 확인하기
# 내가 생각한방법 : true/false 값의 갯수를 count하기
train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [31]:
train["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [34]:
train["Survived"].sum()
# sum() => 값이 없는(NaN)항목들은 무시하고 더해줌
# Q!!!!!!!!!!! 나는 전체 더한값이라서 sum을 사용하면 안될줄알았는데 Survived 값이 boolean(0,1)이라 sum()을 쓴게 맞는지?

342

In [35]:
train.Survived.count()

891

In [42]:
# 7. 생존한사람, 사망한 사람 수 확인하기
y_survived = train["Survived"].sum()
n_survived = train.Survived.count() - train["Survived"].sum()
print(f"생존자 : {y_survived}")
print(f"사망자 : {n_survived}")
# Q!!!!!!!!!!! train.shape[0] 으로 써야하는지? 왜 저렇게쓴건지?

생존자 : 342
사망자 : 549

In [44]:
# 8. 각 클래스('Pclass')별 탑승객 분포 확인하기
train["Pclass"].unique()
train["Pclass"].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [45]:
# 9. 성('Sex')별 탑승객 분표 확인하기
train["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [46]:
# 10. 탑승 위치('Embarked') 별 탑승객 분표 확인하기
train["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [47]:
# 11.'Embarked' 필드의 결측치는 값이 가장 많은 'S'로 할당하기
train["Embarked"].fillna("S")

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

##### https://blog.naver.com/inzzeong/222141569948

In [48]:
# 12. 'Age' 필드의 결측치는 값이 중간값으로 할당하기
train["Age"].fillna("median")

0        22.0
1        38.0
2        26.0
3        35.0
4        35.0
        ...
886      27.0
887      19.0
888    median
889      26.0
890      32.0
Name: Age, Length: 891, dtype: object

In [51]:
# 13. 'Name'필드에서 신분을 나타내는 단어를 뽑아서 'Title' 필드에 할당하기
train[["Name"]] #df형태
# Q!!!!!!!! 신분을 나타내는 단어?

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [ ]:
# 14. 'Title' 필드의 카테고리를 6개의 항목으로 변경하기

In [ ]:
# 15. 변수 y를 선언해서 학습할 목표변수(=종속변수)인 'Survived'필드값을 담기

In [55]:
# 16. 나이('Age') 필드를 그룹핑하여 'AgeGroup'필드 생성하여 할당하기
train[["Age"]]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [61]:
import math
def Age_cat(age):
    if math.isnan(age): # 나이 값이 NaN인지 확인한다
        return -1   # 만약 값이 NaN이면 -1반환 (결측값을 -1로 표시)
    return math.floor(age/10)*10  #나이를 10단위로 구분
    # 만약 나이가 25면 25/10=2.5 인데 math.floor해서 2로되고 거기에 10곱해서 20되는것

In [58]:
train.set_index("Age").groupby(Age_cat)

In [60]:
train.groupby(Age_cat)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000013BC1BE8350>